{
  "Controls": {
    "title": "Панель управления",
    "about": "Про автора",
    "placeholder": "Поиск...",
    "clear": "Очистить Ввод",
    "prev": "Назад",
    "next": "Вперед",
    "search": "Найти"
  },
  "About": {
    "back": "Назад",
    "info": "Меня зовут Денис Ересько, я начинающий фронтенд-разработчик. Моя цель — стать высококвалифицированным специалистом по веб-разработке и продолжать развивать свои знания и навыки в программировании. Я поступил в университет, где проучился два года, но в какой-то момент понял, что мне нужно больше практики и реальных проектов. Я решил взять академический отпуск и сосредоточиться на саморазвитии. Со временем я понял, что меня привлекает фронтенд-разработка, и решил сосредоточиться на этом направлении. Я поступил на курс JavaScript в RS School. Мне захотелось расширить свой кругозор и научиться работать с современными фронтенд-технологиями. Обучение в RS School стало для меня настоящим открытием. Я стал лучше понимать, как строится взаимодействие пользователя с веб-приложением. Одна из моих главных мотиваций — возможность решать сложные задачи и создавать решения, которые делают веб-приложения более удобными и функциональными для пользователей. Мне всегда нравится решать логические задачи, и я сталкиваюсь с ними на каждом этапе разработки. Сложность задач меня не пугает, а, наоборот, мотивирует глубже вникать в проблему и находить наиболее элегантное решение. Я стремлюсь развивать это качество в будущем, чтобы эффективно решать возникающие на работе задачи.",
    "link": "RS-School ссылка"
  },
  "Result": {
    "refresh": "Обновить",
    "close": "Закрыть",
    "name": "Имя",
    "status": "Статус",
    "species": "Вид",
    "gender": "Пол",
    "origin": "Происхождение",
    "location": "Местоположение",
    "error": "Запрос не удался",
    "alt-loading": "Загрузка",
    "alt-result": "Картинка результата"
  },
  "Error Boundary": {
    "error": "Что-то пошло не так",
    "throw": "Выбросить ошибку"
  }
}